# Найдите сумму цифр трехзначного числа.

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

num = int(input('Введите трехзначное число: '))

temp1 = num % 10
temp2 = num // 10 % 10
temp3 = num // 100

sum = temp1 + temp2+ temp3
print(f'Сумма цифр равна: {sum}')